HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC16_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC16_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC16_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC16_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC16_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC16_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC16_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC16_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC16_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC16_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620B2u)

/** \\brief  C, Revision ID Register */
#define MC16_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006200Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc17
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC17_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062100u)

/** \\brief  2, Configuration Register 1 */
#define MC17_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062102u)

/** \\brief  10, Memory ECC Detection Register */
#define MC17_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062110u)

/** \\brief  E, ECC Safety Register */
#define MC17_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006210Eu)

/** \\brief  12, Error Tracking Register */
#define MC17_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062112u)

/** \\brief  14, Error Tracking Register */
#define MC17_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062114u)

/** \\brief  16, Error Tracking Register */
#define MC17_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062116u)

/** \\brief  18, Error Tracking Register */
#define MC17_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062118u)

/** \\brief  1A, Error Tracking Register */
#define MC17_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006211Au)

/** \\brief  4, MBIST Control Register */
#define MC17_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062104u)

/** \\brief  6, Status Register */
#define MC17_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062106u)

/** \\brief  8, Range Register, single address mode */
#define MC17_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062108u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC17_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC17_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC17_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC17_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC17_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC17_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC17_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC17_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC17_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC17_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC17_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC17_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC17_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC17_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC17_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC17_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC17_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC17_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC17_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC17_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC17_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC17_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC17_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC17_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC17_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC17_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC17_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC17_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC17_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC17_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621E6u)

