HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC17_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC17_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC17_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC17_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC17_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC17_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC17_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC17_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC17_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC17_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00621B2u)

/** \\brief  C, Revision ID Register */
#define MC17_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006210Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc18
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC18_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062200u)

/** \\brief  2, Configuration Register 1 */
#define MC18_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062202u)

/** \\brief  10, Memory ECC Detection Register */
#define MC18_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062210u)

/** \\brief  E, ECC Safety Register */
#define MC18_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006220Eu)

/** \\brief  12, Error Tracking Register */
#define MC18_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062212u)

/** \\brief  14, Error Tracking Register */
#define MC18_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062214u)

/** \\brief  16, Error Tracking Register */
#define MC18_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062216u)

/** \\brief  18, Error Tracking Register */
#define MC18_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062218u)

/** \\brief  1A, Error Tracking Register */
#define MC18_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006221Au)

/** \\brief  4, MBIST Control Register */
#define MC18_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062204u)

/** \\brief  6, Status Register */
#define MC18_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062206u)

/** \\brief  8, Range Register, single address mode */
#define MC18_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062208u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC18_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC18_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC18_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC18_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC18_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC18_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC18_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC18_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC18_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC18_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC18_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC18_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC18_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC18_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC18_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC18_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC18_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC18_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC18_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC18_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC18_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC18_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC18_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC18_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC18_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC18_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC18_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC18_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC18_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC18_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622E6u)

