HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC18_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC18_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC18_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC18_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC18_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC18_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC18_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC18_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC18_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC18_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00622B2u)

/** \\brief  C, Revision ID Register */
#define MC18_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006220Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc19
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC19_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062300u)

/** \\brief  2, Configuration Register 1 */
#define MC19_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062302u)

/** \\brief  10, Memory ECC Detection Register */
#define MC19_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062310u)

/** \\brief  E, ECC Safety Register */
#define MC19_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006230Eu)

/** \\brief  12, Error Tracking Register */
#define MC19_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062312u)

/** \\brief  14, Error Tracking Register */
#define MC19_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062314u)

/** \\brief  16, Error Tracking Register */
#define MC19_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062316u)

/** \\brief  18, Error Tracking Register */
#define MC19_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062318u)

/** \\brief  1A, Error Tracking Register */
#define MC19_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006231Au)

/** \\brief  4, MBIST Control Register */
#define MC19_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062304u)

/** \\brief  6, Status Register */
#define MC19_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062306u)

/** \\brief  8, Range Register, single address mode */
#define MC19_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062308u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC19_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC19_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC19_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC19_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC19_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC19_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC19_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC19_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC19_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC19_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC19_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC19_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC19_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC19_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC19_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC19_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC19_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC19_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC19_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC19_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC19_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC19_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC19_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC19_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC19_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC19_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC19_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC19_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC19_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC19_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00623E6u)

