HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC77_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC77_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC77_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC77_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC77_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC77_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC77_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC77_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC77_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC77_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DB2u)

/** \\brief  C, Revision ID Register */
#define MC77_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0065D0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc78
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC78_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065E00u)

/** \\brief  2, Configuration Register 1 */
#define MC78_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065E02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC78_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065E10u)

/** \\brief  E, ECC Safety Register */
#define MC78_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0065E0Eu)

/** \\brief  12, Error Tracking Register */
#define MC78_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065E12u)

/** \\brief  14, Error Tracking Register */
#define MC78_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065E14u)

/** \\brief  16, Error Tracking Register */
#define MC78_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065E16u)

/** \\brief  18, Error Tracking Register */
#define MC78_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065E18u)

/** \\brief  1A, Error Tracking Register */
#define MC78_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065E1Au)

/** \\brief  4, MBIST Control Register */
#define MC78_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065E04u)

/** \\brief  6, Status Register */
#define MC78_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065E06u)

/** \\brief  8, Range Register, single address mode */
#define MC78_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065E08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC78_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC78_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC78_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC78_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC78_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC78_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC78_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC78_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC78_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC78_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC78_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC78_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC78_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC78_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC78_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ECAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC78_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ECCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC78_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ECEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC78_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ED0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC78_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ED2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC78_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ED4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC78_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ED6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC78_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065ED8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC78_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC78_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC78_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC78_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC78_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC78_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC78_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC78_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065EE6u)

